# 더하기
print(8 + 5)    # 13

# 빼기
print(8 - 5)    # 3

# 곱하기
print(8 * 5)    # 40

# 나누기
print(8 / 5)    # 1.6

# 나눗셈의 몫 구하기
print(8 // 5)   # 1

# 나눗셈의 나머지 구하기
print(8 % 5)    # 3

# 거듭제곱
print(8 ** 5)   # 32768

# 값을 대입
age = 18

# 변수에 특정 값을 더하고 그 결과를 다시 변수에 대입
age += 2    # 20

# 변수에 특정 값을 빼고 그 결과를 다시 변수에 대입
age -= 1    # 19

# 변수에 특정 값을 곱하고 그 결과를 다시 변수에 대입
age *= 2    # 38

# 변수에 특정 값을 나누고 그 결과를 다시 변수에 대입
age /= 2    # 19.0

# 변수에 특정 값을 나눈 몫을 구하고 그 결과를 다시 변수에 대입
age //= 2   # 9.0

# 변수에 특정 값을 나눈 나머지를 구하고 그 결과를 다시 변수에 대입
age %= 6    # 3.0

# 변수에 특정 값을 거듭제곱하고 그 결과를 다시 변수에 대입
age **= 3   # 27.0

print(age)